Revit 2024 API
Rectangle.Right Property
 The x-coordinate of the bottom-right corner of the rectangle.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int Right { get; set; }
Visual Basic
Public Property Right As Integer
	Get
	Set
Visual C++
public:
property int Right {
	int get ();
	void set (int value);
}
See Also
Rectangle Class
Autodesk.Revit.DB Namespace